pmo-dataset/mermaid/36.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartMessageEvent_1(("Get airplane request")) --> User_1["Check desired\nairplane type"]
	User_1 --> ExclusiveGateway_1{"Individual\ncustomizing?"}
	ParallelGateway_1{"+"} --> Service_1["Display bar type"]
	ParallelGateway_1 --> User_2["Select number of\nseats"]
	ParallelGateway_1 --> User_3["Select seat color"]
	ParallelGateway_1 --> User_4["Introduce amount of\nwater in the toilets"]
	Service_1 --> ExclusiveGateway_2{"Bar type"}
	User_2 --> ParallelGateway_2{"+"}
	User_3 --> ParallelGateway_2
	User_4 --> ParallelGateway_2
	Send_1["Send customizing\noptions"] --> Receive_1["Receive customizing\nrequirements"]
	Receive_1 --> ParallelGateway_1
	Send_2["Send requirements to\nthe russian team"] --> ExclusiveGateway_3{"X"}
	Send_3["Send requirements to\nthe irish team"] --> ExclusiveGateway_3
	ExclusiveGateway_3 --> Manual_1["Receive bar\ncomponents"]
	Manual_1 --> ParallelGateway_2
	ParallelGateway_2 --> Manual_2["Assemble interior"]
	Manual_4["Sent plane to\ncustomer"] --> Receive_2["Receive customer\nconfirmation"]
	Receive_2 --> EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_4{"Test succesful"} -->|"No"| Manual_5["Ajdust errors"]
	ParallelGateway_3{"+"} --> Manual_3["Flight test"]
	Manual_3 --> ExclusiveGateway_4
	ParallelGateway_3 --> User_5["Update flight\nprotocol"]
	User_5 --> Send_7["Send protocol to\ncustomer"]
	Send_7 --> ParallelGateway_4{"+"}
	ExclusiveGateway_4 -->|"Yes"| ParallelGateway_4
	ParallelGateway_4 --> Manual_4
	Send_4["Send requirements to\nfrench team"] --> ExclusiveGateway_3
	Send_5["Send requirements to\nthe american team"] --> ExclusiveGateway_3
	Send_6["Send requirements to\nthe italian team"] --> ExclusiveGateway_3
	Manual_2 --> ParallelGateway_3
	Manual_5 --> Manual_3
	ExclusiveGateway_1 -->|"Yes"| Send_1
	ExclusiveGateway_1 -->|"No"| Manual_2
	ExclusiveGateway_2 -->|"Vodka bar"| Send_2
	ExclusiveGateway_2 -->|"Whiskey bar"| Send_3
	ExclusiveGateway_2 -->|"Wine bar"| Send_4
	ExclusiveGateway_2 -->|"Cocktail bar"| Send_5
	ExclusiveGateway_2 -->|"Aperol bar"| Send_6
