pmo-dataset/variations/graphviz_with_ids/36.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Check desired\nairplane type"];
  "User_2" [label="Select number of\nseats"];
  "User_3" [label="Select seat color"];
  "User_4" [label="Introduce amount of\nwater in the toilets"];
  "User_5" [label="Update flight\nprotocol"];
  "Service_1" [label="Display bar type"];
  "Send_1" [label="Send customizing\noptions"];
  "Send_2" [label="Send requirements to\nthe russian team"];
  "Send_3" [label="Send requirements to\nthe irish team"];
  "Send_4" [label="Send requirements to\nfrench team"];
  "Send_5" [label="Send requirements to\nthe american team"];
  "Send_6" [label="Send requirements to\nthe italian team"];
  "Send_7" [label="Send protocol to\ncustomer"];
  "Receive_1" [label="Receive customizing\nrequirements"];
  "Receive_2" [label="Receive customer\nconfirmation"];
  "Manual_1" [label="Receive bar\ncomponents"];
  "Manual_2" [label="Assemble interior"];
  "Manual_3" [label="Flight test"];
  "Manual_4" [label="Sent plane to\ncustomer"];
  "Manual_5" [label="Ajdust errors"];
  "StartMessageEvent_1" [shape=circle, label="Get airplane request"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label=""];
  "ExclusiveGateway_1" [shape=diamond, label="Individual\ncustomizing?"];
  "ExclusiveGateway_2" [shape=diamond, label="Bar type"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="Test succesful"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "StartMessageEvent_1" -> "User_1";
  "User_1" -> "ExclusiveGateway_1";
  "ParallelGateway_1" -> "Service_1";
  "ParallelGateway_1" -> "User_2";
  "ParallelGateway_1" -> "User_3";
  "ParallelGateway_1" -> "User_4";
  "Service_1" -> "ExclusiveGateway_2";
  "User_2" -> "ParallelGateway_2";
  "User_3" -> "ParallelGateway_2";
  "User_4" -> "ParallelGateway_2";
  "Send_1" -> "Receive_1";
  "Receive_1" -> "ParallelGateway_1";
  "Send_2" -> "ExclusiveGateway_3";
  "Send_3" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Manual_1";
  "Manual_1" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Manual_2";
  "Manual_4" -> "Receive_2";
  "Receive_2" -> "EndNoneEvent_1";
  "ExclusiveGateway_4" -> "Manual_5" [label="No"];
  "ParallelGateway_3" -> "Manual_3";
  "Manual_3" -> "ExclusiveGateway_4";
  "ParallelGateway_3" -> "User_5";
  "User_5" -> "Send_7";
  "Send_7" -> "ParallelGateway_4";
  "ExclusiveGateway_4" -> "ParallelGateway_4" [label="Yes"];
  "ParallelGateway_4" -> "Manual_4";
  "Send_4" -> "ExclusiveGateway_3";
  "Send_5" -> "ExclusiveGateway_3";
  "Send_6" -> "ExclusiveGateway_3";
  "Manual_2" -> "ParallelGateway_3";
  "Manual_5" -> "Manual_3";
  "ExclusiveGateway_1" -> "Send_1" [label="Yes"];
  "ExclusiveGateway_1" -> "Manual_2" [label="No"];
  "ExclusiveGateway_2" -> "Send_2" [label="Vodka bar"];
  "ExclusiveGateway_2" -> "Send_3" [label="Whiskey bar"];
  "ExclusiveGateway_2" -> "Send_4" [label="Wine bar"];
  "ExclusiveGateway_2" -> "Send_5" [label="Cocktail bar"];
  "ExclusiveGateway_2" -> "Send_6" [label="Aperol bar"];
}
